//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема поддержки инспектора свойств
// Группа: Атрибуты зависимости от логического условия равенства
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusInspectorConditionVisible.cs
*		Атрибут видимости(отображения поля/свойства)в зависимости от логического условия равенства.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreInspectorCondition
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут видимости(отображения поля/свойства)в зависимости от логического условия равенства
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
		public sealed class LotusVisibleEqualityAttribute : LotusInspectorItemAttribute
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal String mManagingMemberName;
			internal TInspectorMemberType mMemberType;
			internal Boolean mValue;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Имя члена объекта от которого определяется видимость
			/// </summary>
			public String ManagingMemberName
			{
				get { return mManagingMemberName; }
				set { mManagingMemberName = value; }
			}

			/// <summary>
			/// Тип члена объекта
			/// </summary>
			public TInspectorMemberType MemberType
			{
				get { return mMemberType; }
				set { mMemberType = value; }
			}

			/// <summary>
			/// Целевое значение поля/свойства при котором существует видимость
			/// </summary>
			public Boolean Value
			{
				get { return mValue; }
				set { mValue = value; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="managing_member_name">Имя члена объекта от которого определяется видимость</param>
			/// <param name="member_type">Тип члена объекта</param>
			/// <param name="value">Целевое значение поля/свойства при котором существует видимость</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusVisibleEqualityAttribute(String managing_member_name, TInspectorMemberType member_type, Boolean value)
			{
				mManagingMemberName = managing_member_name;
				mMemberType = member_type;
				mValue = value;
			}
			#endregion

			#region ======================================= МЕТОДЫ РЕДАКТОРА UNITY ====================================
#if UNITY_EDITOR
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Проверка на видимость элемента инспектор свойств в результате применения данного атрибута
			/// </summary>
			/// <returns>Статус видимости</returns>
			//---------------------------------------------------------------------------------------------------------
			public override Boolean CheckVisible()
			{
				if(mOwned != null && mOwned.Instance != null)
				{
					// Получаем значение от члена объекта от которого зависит видимость
					Boolean visible = mOwned.GetValueFromMember<Boolean>(ManagingMemberName, mMemberType);

						// Если значения совпадают значит элемент видим
					return (visible == Value);
				}

				return true;
			}
#endif
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================