//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Базовая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusBaseBoolean.cs
*		Работа с логическим типом платформы NET.
*		Реализация дополнительных методов работы с логическим типом платформы NET.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Reflection;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreBase
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий дополнительные методы для работы с типом <see cref="Boolean"/>
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XBoolean
		{
			/// <summary>
			/// Текстовые значение логического типа которые означает истинное значение
			/// </summary>
			public static readonly String[] TrueValues = new String[]
			{
				"True",
				"true",
				"1",
				"on",
				"On",
				"истина",
				"Истина",
				"да",
				"Да"
			};

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Преобразование текста в логическое значение
			/// </summary>
			/// <param name="text">Текст</param>
			/// <returns>Значение</returns>
			//---------------------------------------------------------------------------------------------------------
			public static Boolean Parse(String text)
			{
				return (Array.IndexOf(TrueValues, text) > -1);
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================