//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема хранения состояний
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusMementoOriginator.cs
*		Интерфейс объекта для который имеет внутреннее состояние с возможностью его предоставить и в последующем восстановить.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.ComponentModel;
using System.Reflection;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreMemento
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс объекта для который имеет внутреннее состояние с возможностью его предоставить и в последующем восстановить
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusMementoOriginator
		{
			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получить состояние объекта
			/// </summary>
			/// <param name="name_state">Наименование состояния объекта</param>
			/// <returns>Состояние объекта</returns>
			//---------------------------------------------------------------------------------------------------------
			System.Object GetMemento(String name_state);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установить состояние объекта
			/// </summary>
			/// <param name="memento">Состояние объекта</param>
			/// <param name="name_state">Наименование состояния объекта</param>
			//---------------------------------------------------------------------------------------------------------
			void SetMemento(System.Object memento, String name_state);
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================