//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема поддержки инспектора свойств
// Группа: Атрибуты дополнительного описания поля/свойства объекта
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusInspectorDescDisplayName.cs
*		Атрибут для отображения удобочитаемого имя свойства или поля.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.Reflection;
using System.Collections.Generic;
using System.ComponentModel;
using System.Globalization;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreInspectorDesc
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут для отображения удобочитаемого имя свойства или поля
		/// </summary>
		/// <remarks>
		/// Может применяться для отображения имени на соответствующем языке
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
		public sealed class LotusDisplayNameAttribute : Attribute
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal readonly String mName;
			internal readonly Int32 mIndent;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Отображаемое имя свойства
			/// </summary>
			public String Name
			{
				get { return mName; }
			}

			/// <summary>
			/// Уровень смещения
			/// </summary>
			public Int32 Indent
			{
				get { return mIndent; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Отображаемое имя</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusDisplayNameAttribute(String name)
			{
				mName = name;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="name">Отображаемое имя</param>
			/// <param name="indent">Уровень смещения</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusDisplayNameAttribute(String name, Int32 indent)
			{
				mName = name;
				mIndent = indent;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================