//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема расширения функциональности редактора Unity
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusUnityEditorInspectorParams.cs
*		Определение размеров и разметки для отображении элементов редактирования в инспекторе свойств.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Reflection;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreUnityEditor
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс определяющий размеры и разметку для отображении элементов редактирования в инспекторе свойств.
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XInspectorViewParams
		{
			#region ======================================= КОНСТАНТНЫЕ ДАННЫЕ ========================================
			/// <summary>
			/// Стандартный отступ между элементами инспектора свойств
			/// </summary>
			public const Single SPACE = 2; //UnityEditor.EditorGUIUtility.standardVerticalSpacing;

			/// <summary>
			/// Стандартная высота одного элемента инспектора свойств
			/// </summary>
			public const Single CONTROL_HEIGHT = 18; // UnityEditor.EditorGUIUtility.singleLineHeight;

			/// <summary>
			/// Высота одного элемента инспектора свойств с отступом
			/// </summary>
			public const Single CONTROL_HEIGHT_SPACE = CONTROL_HEIGHT + SPACE;

			/// <summary>
			/// Высота заголовка
			/// </summary>
			public const Single HEADER_HEIGHT = CONTROL_HEIGHT + SPACE * 2;

			/// <summary>
			/// Ширина одной мини кнопки
			/// </summary>
			public const Single BUTTON_MINI_WIDTH = 20;

			/// <summary>
			/// Высота одной мини кнопки
			/// </summary>
			public const Single BUTTON_MINI_HEIGHT = CONTROL_HEIGHT;

			/// <summary>
			/// Ширина иконки-кнопки для предпросмотра
			/// </summary>
			public const Single BUTTON_PREVIEW_WIDTH = 16;

			/// <summary>
			/// Ширина полосы прокрутки инспектора свойств
			/// </summary>
			public const Single SCROLL_WIDTH = 16;

			/// <summary>
			/// Отступ в пикселях на 1 уровень вложенности(глубины) элемента
			/// </summary>
			public const Int32 OFFSET_INDENT = 12;
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================