//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема сервисов OS
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusBaseServiceFileDialogsUnity.cs
*		Реализации диалогов открытия/сохранения файлов и директории для Unity.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.ComponentModel;
using System.IO;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreServiceOS
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Реализации диалогов открытия/сохранения файлов и директории для Unity
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public class CFileDialogsUnity : ILotusFileDialogs
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Показ диалога для открытия файла
			/// </summary>
			/// <param name="title">Заголовок диалога</param>
			/// <param name="directory">Директория для открытия файла</param>
			/// <param name="extension">Расширение файла без точки или список расширений или null</param>
			/// <returns>Полное имя существующего файла или null</returns>
			//---------------------------------------------------------------------------------------------------------
			public String Open(String title, String directory, String extension)
			{
#if UNITY_EDITOR
				return (UnityEditor.EditorUtility.OpenFilePanel(title, directory, extension));
#else
				return("");
#endif

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Показ диалога для сохранения файла
			/// </summary>
			/// <param name="title">Заголовок диалога</param>
			/// <param name="directory">Директория для сохранения файла</param>
			/// <param name="default_name">Имя файла по умолчанию</param>
			/// <param name="extension">Расширение файла без точки</param>
			/// <returns>Полное имя файла или null</returns>
			//---------------------------------------------------------------------------------------------------------
			public String Save(String title, String directory, String default_name, String extension)
			{
#if UNITY_EDITOR
				return (UnityEditor.EditorUtility.SaveFilePanel(title, directory, default_name, extension));
#else
				return("");
#endif
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================