//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCoreModule.cs
*		Базовый набор содержащий код развивающий в целом платформу NET.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
using System.Runtime.CompilerServices;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup Basis Базовый набор
		//! Базовый набор содержащий код развивающий в целом платформу NET.
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup Core Модуль базового ядра
		//! Модуль, содержащий код, развивающий в целом платформу NET и реализующий дополнительную базовую функциональность
		//! на уровне среды NET. Большинство реализаций модуля кроссплатформенно. Является основой для построения других 
		//! подсистем и модулей.
		//! Применительно к Unity модуль расширяет функциональность базовых типов, при этом в модуле не содержится никаких 
		//! компонентов для Unity, работа осуществляется через центральные диспетчеры и путем непосредственного использования
		//! объектов в коде. Модуль также содержит расширение функциональности редактора Unity.
		//! Модуль это прежде всего кроссплатформенный набор инструментов для решения повседневных задач: большая библиотека
		//! расширений, реализации коллекций на основе массива, гибкая и универсальная подсистема задач, подсистема сообщений
		//! и многое другое.
		//! Модуль общей функциональности реализует общую функциональность на уровне компонент Unity.
		//! Модуль общей функциональности включает: подсистему анимации, гибкую подсистему локализации, подсистему связывания
		//! данных, набор компонентов для управления камерами, мощную подсистему сериализацию(включая сохранение в формат 
		//! XML, определение нужного объема сохраняемых данных, сохранение в режиме редактора и в режиме игры).
		//! \ingroup Basis
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================