//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема коллекций
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCollectionCommon.cs
*		Общие типы и структуру данных подсистемы коллекций.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
using System.Collections;
using System.Collections.Generic;
using System.Collections.Specialized;
using System.ComponentModel;
using System.Reflection;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup CoreCollections Подсистема коллекций
		//! Дополнительные коллекции данных. Реализация дополнительных коллекций на основе массива которые обеспечивает 
		//! расширенную функциональность, поддержку обобщенного интерфейса IList, уведомлений о смене состояний, а также
		//! более высокую скорость работы за счет непосредственного доступа к массиву.
		//!
		//! Большинство коллекций поддерживает сериализацию на уровне Unity, также предусмотрен встроенный редактор для 
		//! расширенного управления и отображения коллекцией (в том числе и с возможностью перемещать элементы).
		//! \ingroup Core
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Базовый интерфейс для определения коллекции элементов
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusCollectionItem
		{
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================