//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема поддержки инспектора свойств
// Группа: Атрибуты для управления и оформления числовых свойств/полей
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusInspectorNumberFormat.cs
*		Атрибут для определения форматирование значения числовой величины.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Globalization;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup CoreInspectorNumber Атрибуты числовых данных
		//! Атрибуты для управления и оформления числовых свойств/полей
		//! \ingroup CoreInspector
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут для определения форматирование значения числовой величины
		/// </summary>
		/// <remarks>
		/// Применяется стандартное форматирование строки, значение передается в качестве первого аргумента
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
		public sealed class LotusNumberFormatAttribute : Attribute
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal readonly String mFormatValue;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Формат отображения значения числовой величины
			/// </summary>
			public String FormatValue
			{
				get { return mFormatValue; }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="format_value">Формат отображения значения числовой величины</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusNumberFormatAttribute(String format_value)
			{
				mFormatValue = format_value;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================