//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема ресурсов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusResourcesExtensionTextAsset.cs
*		Работа со стандартным текстовым ресурсом.
*		Реализация дополнительных методов, константных данных, а также методов расширения функциональности ресурса TextAsset.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using UnityEngine;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreUnityResource
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий методы расширений ресурса TextAsset
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XExtensionTextAsset
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Возвращение массива строк текстового ресурса
			/// </summary>
			/// <param name="this">Текстовый ресурс</param>
			/// <returns>Массив строк</returns>
			//---------------------------------------------------------------------------------------------------------
			public static String[] GetAllLines(this TextAsset @this)
			{
				return @this.text.Split(XString.SeparatorNewCarriageLine, StringSplitOptions.RemoveEmptyEntries);
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================