//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Методы расширений
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusExtensionObject.cs
*		Методы расширения для работы с обобщенными и базовыми типами платформы NET.
*		Реализация методов расширений направленных на работу с обобщенными и базовыми типам платформы. Для некоторых 
*	базовых типов методы расширения выделены в отдельный файл.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.ComponentModel;
using System.Collections.Generic;
using System.Reflection;
using System.Text;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup CoreExtension Методы расширений
		//! Общие методы расширения для базовых типов платформы NET и Unity.
		//! В подсистеме приведены только общие методы расширения базовых типов платформы NET и Unity направленных на 
		//! унификацию функциональных возможностей. Специфичные методы расширения будут реализованы в соответствующих 
		//! подсистемах.
		//! \ingroup Core
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий методы расширения с обобщенными типами
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XExtensionObject
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Безопасная проверка на существование объекта
			/// </summary>
			/// <remarks>
			/// Применяется в подсистеме Unity
			/// </remarks>
			/// <typeparam name="TType">Тип объекта</typeparam>
			/// <param name="this">Объект</param>
			/// <returns>Статус отсутствия объекта</returns>
			//---------------------------------------------------------------------------------------------------------
			public static Boolean IsObjectNull<TType>(this TType @this) where TType : class
			{
				return (@this == null || @this.Equals(null));
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================