//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема сериализации
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusSerializationBaseXml.cs
*		Определение интерфейс для сериализации данных который обеспечивает сохраннее/загрузку данных самостоятельно 
*	объектом в формат XML.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.IO;
using System.Xml;
using System.Reflection;
using System.ComponentModel;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreSerialization
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для сериализации данных который обеспечивает сохраннее/загрузку данных самостоятельно объектом 
		/// в формат XML
		/// </summary>
		/// <remarks>
		/// <para>
		/// Реализация интерфейса требуется если нужно как-то специфично записать/прочитать данные и классическая
		/// модель чтения/записи свойств и полей не подходит.
		/// </para>
		/// <para>
		/// Кроме этого реализация интерфейса позволяет меньше использовать рефлексию данных что положительно
		/// сказывается на общей скорости работы.
		/// </para>
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusSerializeToXml
		{
			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Запись данных объекта в формат данных XML
			/// </summary>
			/// <remarks>
			/// Здесь должна быть реализована запись только данных элемента
			/// </remarks>
			/// <param name="xml_writer">Средство записи данных в формат XML</param>
			//---------------------------------------------------------------------------------------------------------
			void WriteToXml(XmlWriter xml_writer);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Чтение данных объекта из данных в формате XML
			/// </summary>
			/// <param name="xml_reader">Средство чтения данных формата XML</param>
			//---------------------------------------------------------------------------------------------------------
			void ReadFromXml(XmlReader xml_reader);
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================