//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема сообщений
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusMessageHandler.cs
*		Определение основного интерфейса для подписки на события.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreMessage
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения типовых кодов обработки сообщения 
		/// </summary>
		/// <remarks>
		/// Сообщение может быть обработано с возвратом любого результата за исключением системных
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public static class XMessageHandlerResultCode
		{
			/// <summary>
			/// Сообщение выполнено с отрицательным результатом
			/// </summary>
			public const Int32 NEGATIVE_RESULT = -1;

			/// <summary>
			/// Сообщение не обработано
			/// </summary>
			public const Int32 NOT_PROCESSED = 0;
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для определения возможности обработки сообщения
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusMessageHandler
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Группа которой принадлежит данный обработчик событий
			/// </summary>
			String MessageHandlerGroup { get; }
			#endregion

			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Основной метод для обработки сообщения
			/// </summary>
			/// <param name="args">Аргументы сообщения</param>
			/// <returns>Результат обработки сообщения</returns>
			//---------------------------------------------------------------------------------------------------------
			Int32 OnMessageHandler(CMessageArgs args);
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================