//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема сообщений
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusMessageDispatcher.cs
*		Центральный диспетчер для работы с сообщениями.
*		Реализация центрального диспетчера сообщений, который используется издателя по умолчанию хранит обеспечивает 
*	централизованную посылку и обработку сообщений.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreMessage
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Центральный диспетчер для работы с сообщениями
		/// </summary>
		/// <remarks>
		/// Реализация центрального диспетчера сообщений, который используется издателя по умолчанию хранит обеспечивает
		/// централизованную посылку и обработку сообщений.
		/// Методы центрального диспетчера нужно вызывать вручную в соответствующих местах
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public static class XMessageDispatcher
		{
			#region ======================================= ДАННЫЕ ====================================================
			public static List<CPublisher> mPublishers;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Список всех издателей
			/// </summary>
			public static List<CPublisher> Publishers
			{
				get 
				{
					if(mPublishers == null)
					{
						OnInit();
					}
					return (mPublishers);
				}
			}

			/// <summary>
			/// Издатель по умолчанию
			/// </summary>
			public static CPublisher Default
			{
				get { return (Publishers[0]); }
			}
			#endregion

			#region ======================================= ОСНОВНЫЕ МЕТОДЫ ДИСПЕТЧЕРА ================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Перезапуск данных центрального диспетчера в режиме редактора
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public static void OnResetEditor()
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Первичная инициализация данных центрального диспетчера для работы с сообщениями
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public static void OnInit()
			{
				if (mPublishers == null)
				{
					mPublishers = new List<CPublisher>();
					mPublishers.Add(new CPublisher("System"));
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Обработка сообщений
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public static void OnUpdate()
			{
				for (Int32 i = 0; i < mPublishers.Count; i++)
				{
					mPublishers[i].OnUpdate();
				}
			}
			#endregion

			#region ======================================= МЕТОДЫ ILotusMessageHandler ===============================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Регистрация подписки на обработку сообщений
			/// </summary>
			/// <param name="message_handler">Интерфейс для обработки сообщений</param>
			//---------------------------------------------------------------------------------------------------------
			public static void RegisterMessageHandler(ILotusMessageHandler message_handler)
			{
				Default.RegisterMessageHandler(message_handler);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Отмена регистрации подписки на обработку сообщений
			/// </summary>
			/// <param name="message_handler">Интерфейс для обработки сообщений</param>
			//---------------------------------------------------------------------------------------------------------
			public static void UnRegisterMessageHandler(ILotusMessageHandler message_handler)
			{
				Default.UnRegisterMessageHandler(message_handler);
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Послать сообщения всем
			/// </summary>
			/// <param name="message">Аргументы сообщения</param>
			//---------------------------------------------------------------------------------------------------------
			public static void SendMessage(CMessageArgs message)
			{
				Default.SendMessage(message);
			}

#if (UNITY_2017_1_OR_NEWER)
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Послать сообщения всем
			/// </summary>
			/// <param name="name">Имя сообщения</param>
			/// <param name="data">Данные сообщения</param>
			/// <param name="sender">Источник сообщения</param>
			//---------------------------------------------------------------------------------------------------------
			public static void SendMessage(String name, Single data, UnityEngine.MonoBehaviour sender)
			{
				Default.SendMessage(name, data, sender);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Послать сообщения всем
			/// </summary>
			/// <param name="name">Имя сообщения</param>
			/// <param name="data">Данные сообщения</param>
			/// <param name="sender">Источник сообщения</param>
			//---------------------------------------------------------------------------------------------------------
			public static void SendMessage(String name, UnityEngine.Vector3 data, UnityEngine.MonoBehaviour sender)
			{
				Default.SendMessage(name, data, sender);
			}
#endif
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Послать сообщения определённой группе объектов
			/// </summary>
			/// <param name="group">Группа для которой отправляется сообщение</param>
			/// <param name="message">Аргументы сообщения</param>
			//---------------------------------------------------------------------------------------------------------
			public static void SendMessage(String group, CMessageArgs message)
			{
				Default.SendMessage(group, message);
			}

#if (UNITY_2017_1_OR_NEWER)
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Послать сообщения определённой группе объектов
			/// </summary>
			/// <param name="group">Группа для которой отправляется сообщение</param>
			/// <param name="name">Имя сообщения</param>
			/// <param name="sender">Источник сообщения</param>
			//---------------------------------------------------------------------------------------------------------
			public static void SendMessage(String group, String name, UnityEngine.MonoBehaviour sender)
			{
				Default.SendMessage(group, name, sender);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Послать сообщения определённой группе объектов
			/// </summary>
			/// <param name="group">Группа для которой отправляется сообщение</param>
			/// <param name="name">Имя сообщения</param>
			/// <param name="data">Данные сообщения</param>
			/// <param name="sender">Источник сообщения</param>
			//---------------------------------------------------------------------------------------------------------
			public static void SendMessage(String group, String name, Single data, UnityEngine.MonoBehaviour sender)
			{
				Default.SendMessage(group, name, data, sender);
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Послать сообщения определённой группе объектов
			/// </summary>
			/// <param name="group">Группа для которой отправляется сообщение</param>
			/// <param name="name">Имя сообщения</param>
			/// <param name="data">Данные сообщения</param>
			/// <param name="sender">Источник сообщения</param>
			//---------------------------------------------------------------------------------------------------------
			public static void SendMessage(String group, String name, UnityEngine.Vector3 data, UnityEngine.MonoBehaviour sender)
			{
				Default.SendMessage(group, name, data, sender);
			}
#endif
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================