//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Базовая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCoreBaseTesting.cs
*		Тестирование базовой подсистемы модуля базового ядра.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Reflection;
using UnityEngine;
using UnityEditor;
using NUnit.Framework;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace Editor
	{
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для тестирования базовой подсистемы модуля базового ядра
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XCoreBaseTesting
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Служебный класс для тестирования
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public class TestA
			{

			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Служебный класс для тестирования
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public class TestB : TestA, ILotusDuplicate<TestA>
			{
				public TestA Duplicate()
				{
					return (new TestB());
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Служебный класс для тестирования
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public class TestC : TestB
			{
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Служебный класс для тестирования
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			public class TestOther : ILotusDuplicate<TestA>
			{
				TestA test;

				public TestA Duplicate()
				{
					if(test == null)
					{
						test = new TestA();
					}

					return (test);
				}
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Тестирование методов <see cref="ILotusDuplicate{TType}"/>
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			[Test]
			public static void TestInterfaceDuplicate()
			{
				TestA result = null;

				TestB testB = new TestB();
				TestC testC = new TestC();
				TestOther testOther = new TestOther();

				result = testB.Duplicate();
				result = testC.Duplicate();
				result = testOther.Duplicate();

				//TUnitArea area = (TUnitArea)XEnum.ConvertFromDescriptionOrName(typeof(TUnitArea), nameof(TUnitArea.SquareCentimeter));
				//Assert.AreEqual(area, TUnitArea.SquareCentimeter);

				//area = (TUnitArea)XEnum.ConvertFromAbbreviationOrName(typeof(TUnitArea), "см2");
				//Assert.AreEqual(area, TUnitArea.SquareCentimeter);
			}
		}
	}
}
//=====================================================================================================================