//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема расширения функциональности редактора Unity
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusViewerZoomContentWindow.cs
*		Редактор для просмотра, масштабирования и панорамирование внутреннего контента.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
#if UNITY_EDITOR
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.Linq;
using System.IO;
using UnityEngine;
using UnityEditor;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
//---------------------------------------------------------------------------------------------------------------------
/// <summary>
/// Редактор для просмотра, масштабирования и панорамирование внутреннего контента
/// </summary>
//---------------------------------------------------------------------------------------------------------------------
public class LotusViewerZoomContentWindow : LotusUtilityBaseWindow
{
	#region =============================================== СТАТИЧЕСКИЕ МЕТОДЫ ========================================
	//-----------------------------------------------------------------------------------------------------------------
	/// <summary>
	/// Показать окно для просмотра, масштабирования и панорамирование внутреннего контента
	/// </summary>
	//-----------------------------------------------------------------------------------------------------------------
	[MenuItem(XCoreEditorSettings.MenuPathUtility + "Viewer Zoom Content", false, XCoreEditorSettings.MenuOrderUtility + 15)]
	public static void ShowViewerZoomContent()
	{
		var window = GetWindow<LotusViewerZoomContentWindow>();
		window.titleContent.text = "Viewer Zoom Content";

		window.OnConstruct();
		window.Show();
	}
	#endregion

	#region =============================================== ДАННЫЕ ====================================================
	// Основные данные
	#endregion

	#region =============================================== ОБШИЕ МЕТОДЫ ==============================================
	//-----------------------------------------------------------------------------------------------------------------
	/// <summary>
	/// Конструирование окна
	/// </summary>
	//-----------------------------------------------------------------------------------------------------------------
	public void OnConstruct()
	{
		mIsManager = false;
	}
	#endregion

	#region =============================================== МЕТОДЫ РИСОВАНИЯ ==========================================
	//-----------------------------------------------------------------------------------------------------------------
	/// <summary>
	/// Рисование основной панели
	/// </summary>
	//-----------------------------------------------------------------------------------------------------------------
	public override void DrawContent()
	{
		GUILayout.Box("RectContent", GUILayout.ExpandHeight(true), GUILayout.ExpandWidth(true));
	}
	#endregion
}
//=====================================================================================================================
#endif
//=====================================================================================================================