//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема компонентов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusComponentsExtensionRigidbody.cs
*		Методы расширения функциональности компонента Rigidbody.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections;
using System.Collections.Generic;
using System.Reflection;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreUnityComponent
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий методы расширений функциональности компонента Rigidbody
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XExtensionRigidbody
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Зафиксировать вращение/перемещение по всем осям
			/// </summary>
			/// <param name="this">Компонент физики</param>
			//---------------------------------------------------------------------------------------------------------
			public static void FreezeAll(this Rigidbody @this)
			{
				@this.constraints = RigidbodyConstraints.FreezeAll;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Зафиксировать вращение по всем осям
			/// </summary>
			/// <param name="this">Компонент физики</param>
			//---------------------------------------------------------------------------------------------------------
			public static void FreezePosition(this Rigidbody @this)
			{
				@this.constraints = RigidbodyConstraints.FreezePosition;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Зафиксировать вращение по всем осям
			/// </summary>
			/// <param name="this">Компонент физики</param>
			//---------------------------------------------------------------------------------------------------------
			public static void FreezeRotation(this Rigidbody @this)
			{
				@this.constraints = RigidbodyConstraints.FreezeRotation;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Зафиксировать вращение/перемещение по всем осям
			/// </summary>
			/// <param name="this">Компонент физики</param>
			/// <param name="except">Исключение компонента фиксации</param>
			//---------------------------------------------------------------------------------------------------------
			public static void FreezeAllExcept(this Rigidbody @this, RigidbodyConstraints except)
			{
				@this.constraints = RigidbodyConstraints.FreezeAll - (Int32)except;
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================