//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема компонентов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusComponentsExtensionLight.cs
*		Методы расширения функциональности компонента Light.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
using System.Collections;
using System.Collections.Generic;
using System.Reflection;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreUnityComponent
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий методы расширений функциональности компонента Light
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XExtensionLight
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Добавление слоя видимости освещаемых источником света
			/// </summary>
			/// <param name="this">Источник света</param>
			/// <param name="layer">Флаг слоя</param>
			//---------------------------------------------------------------------------------------------------------
			public static void LayerAdd(this Light @this, Int32 layer)
			{
				LayerMask currentMask = @this.cullingMask;
				if (currentMask == (currentMask | (1 >> layer)))
					currentMask += (Int32)Mathf.Pow(2, layer);
				@this.cullingMask = currentMask;
			}

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Удаления слоя видимости освещаемых источником света
			/// </summary>
			/// <param name="this">Источник света</param>
			/// <param name="layer">Флаг слоя</param>
			//---------------------------------------------------------------------------------------------------------
			public static void LayerRemove(this Light @this, Int32 layer)
			{
				LayerMask currentMask = @this.cullingMask;
				if (currentMask == (currentMask | (1 << layer)))
					currentMask -= (Int32)Mathf.Pow(2, layer);
				@this.cullingMask = currentMask;
			}
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================