//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема ресурсов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusResourcesExtensionFont.cs
*		Работа со шрифтами.
*		Реализация дополнительных методов и константных данных при работе со шрифтами.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
using UnityEngine;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreUnityResource
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс реализующий дополнительные методы и константные данные при работе со шрифтами
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XFont
		{
			#region ======================================= КОНСТАНТНЫЕ ДАННЫЕ ========================================
			/// <summary>
			/// Имя стандартного шрифта Arial
			/// </summary>
			public const String ARIAL_NAME = "Arial";
			#endregion

			#region ======================================= ДАННЫЕ ====================================================
			private static Font mArial;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Cтандартный шрифт Arial
			/// </summary>
			public static Font Arial
			{
				get
				{
					if (mArial == null)
					{
						LoadDefault();
					}

					return (mArial);
				}
			}
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Загрузка шрифтов по умолчанию
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			internal static void LoadDefault()
			{
				mArial = Resources.GetBuiltinResource<Font>("Arial.ttf"); 
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================