//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема поддержки инспектора свойств
// Группа: Атрибуты для расширенного управления и отображения коллекций
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusInspectorCollectionColumn.cs
*		Атрибут для определения колонки отображения данных дочернего поля/свойства объекта.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 30.01.2022
//=====================================================================================================================
using System;
using System.Collections;
using System.Reflection;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup CoreUnityInspectorCollection
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Атрибут для определения колонки отображения данных дочернего поля/свойства объекта
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		[AttributeUsage(AttributeTargets.Property | AttributeTargets.Field, Inherited = false, AllowMultiple = false)]
		public class LotusColumnAttribute : Attribute
		{
			#region ======================================= ДАННЫЕ ====================================================
			internal readonly Single mPercent;
			#endregion

			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Процент занимаемой ширины
			/// </summary>
			public Single Percent
			{
				get { return (mPercent); }
			}
			#endregion

			#region ======================================= КОНСТРУКТОРЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Конструктор инициализирует объект класса указанными параметрами
			/// </summary>
			/// <param name="percent">Процент занимаемой ширины</param>
			//---------------------------------------------------------------------------------------------------------
			public LotusColumnAttribute(Single percent)
			{
				mPercent = percent;
			}
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================