//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема защиты
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCoreParametersTesting.cs
*		Тестирование подсистемы параметрических объектов модуля базового ядра.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 04.04.2021
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Reflection;
using UnityEngine;
using UnityEditor;
using NUnit.Framework;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace Editor
	{
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для тестирования подсистемы параметрических объектов модуля базового ядра
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XCoreParametersTesting
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Тестирование подсистемы параметрических объектов
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			[Test]
			public static void TestParameters()
			{
				CParameters parameter_inner = new CParameters(223, new CParameterString("Имя", "Эра"));

				CParameters parameterObject = new CParameters("Программа",
					new CParameterString("Имя", "Эра"), parameter_inner);

				Assert.AreEqual(parameterObject.Value[0].Name, "Имя");
				Assert.AreEqual(parameterObject.Value[0].Value, "Эра");

				//parameterObject
			}
		}
	}
}
//=====================================================================================================================