//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль базового ядра
// Подраздел: Подсистема управления камерами
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusCameraCommon.cs
*		Определение общих данных при работе с камерами.
*		В подсистеме камер приведения типовые универсальные реализации компонентов для управления камерами.
*	Специализированные камеры будут реализованы в соответствующих подсистемах.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Core
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup CoreUnityCamera Подсистема управления камерами
		//! Подсистема управления камерами реализует компоненты для типового и универсального управления камерами.
		//! Специализированные камеры будут реализованы в соответствующих подсистемах.
		//! \ingroup CoreUnity
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс определения данных ввода для управления камерами
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XCameraInput
		{
			/// <summary>
			/// Название оси для управления в горизонтальной плоскости
			/// </summary>
			public static String AxisHorizontalName = XAxis.MOUSE_X;

			/// <summary>
			/// Название оси для управления в вертикальной плоскости
			/// </summary>
			public static String AxisVerticalName = XAxis.MOUSE_Y;

			/// <summary>
			/// Название оси для управления приближением камеры
			/// </summary>
			public static String AxisOrbitName = XAxis.MOUSE_SCROLL_WHEEL;
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================